_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_НастройкиВерсионированияОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СМ_НастройкиВерсионированияОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛогинSQL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПарольSQL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерверSQL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьПриЗаписи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьПриИзмененииПодчиненных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьПриПересчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьПриУтверждении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохранятьРегламентно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокХраненияВерсий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СрокиХраненияВерсий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранитьВоВнешнейБазе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/СМ_НастройкиВерсионированияОбъектов/Forms/НастройкаХранения/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастроитьРасписаниеОчищатьРегламентно(Команда)
	ДиалогРасписания = Новый ДиалогРасписанияРегламентногоЗадания(ТекущееРасписание("СМ_ОчисткаИсторииСостояния"));
	ОписаниеОповещения = Новый ОписаниеОповещения("НастроитьРасписаниеЗавершениеОчистка", ЭтотОбъект, "СМ_ОчисткаИсторииСостояния");
	ДиалогРасписания.Показать(ОписаниеОповещения);
КонецПроцедуры


&НаКлиенте
Процедура НастроитьРасписание(Команда)
	ДиалогРасписания = Новый ДиалогРасписанияРегламентногоЗадания(ТекущееРасписание("СМ_СохранятьСостояние"));
	ОписаниеОповещения = Новый ОписаниеОповещения("НастроитьРасписаниеЗавершение", ЭтотОбъект, "СМ_СохранятьСостояние");
	ДиалогРасписания.Показать(ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеЗавершениеОчистка(Расписание, ДополнительныеПараметры) Экспорт
	Если Расписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	УстановитьПараметрРегламентногоЗадания("Расписание", Расписание, ДополнительныеПараметры);
	Элементы.РасписаниеОчистка.Заголовок = Расписание;
КонецПроцедуры


&НаКлиенте
Процедура НастроитьРасписаниеЗавершение(Расписание, ДополнительныеПараметры) Экспорт
	Если Расписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	УстановитьПараметрРегламентногоЗадания("Расписание", Расписание, ДополнительныеПараметры);
	Элементы.Расписание.Заголовок = Расписание;
КонецПроцедуры

&НаКлиенте
Процедура СохранятьРегламентноПриИзменении(Элемент)
	УстановитьПараметрРегламентногоЗадания("Использование", Запись.СохранятьРегламентно,"СМ_СохранятьСостояние");
	Элементы.Расписание.Доступность = Запись.СохранятьРегламентно;
	Элементы.НастроитьРасписание.Доступность = Запись.СохранятьРегламентно;

КонецПроцедуры

&НаКлиенте
Процедура СрокХраненияВерсийПриИзменении(Элемент)
	УстановитьПараметрРегламентногоЗадания("Использование", ЗначениеЗаполнено(Запись.СрокХраненияВерсий),"СМ_ОчисткаИсторииСостояния");
	Элементы.РасписаниеОчистка.Доступность = ЗначениеЗаполнено(Запись.СрокХраненияВерсий);
	Элементы.НастроитьРасписаниеОчистки.Доступность = ЗначениеЗаполнено(Запись.СрокХраненияВерсий);
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрРегламентногоЗадания(ИмяПараметра, ЗначениеПараметра, РегЗадание)
	ПараметрыЗадания = Новый Структура;
	ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания[РегЗадание]);
	
	УстановитьПривилегированныйРежим(Истина);
	
	СписокЗаданий = РегламентныеЗаданияСервер.НайтиЗадания(ПараметрыЗадания);
	Если СписокЗаданий.Количество() = 0 Тогда
		ПараметрыЗадания = Новый Структура;
		ПараметрыЗадания.Вставить(ИмяПараметра, ЗначениеПараметра);
		ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания[РегЗадание]);
		РегламентныеЗаданияСервер.ДобавитьЗадание(ПараметрыЗадания);
	Иначе
		ПараметрыЗадания = Новый Структура(ИмяПараметра, ЗначениеПараметра);
		Для Каждого Задание Из СписокЗаданий Цикл
			РегламентныеЗаданияСервер.ИзменитьЗадание(Задание, ПараметрыЗадания);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ТекущееРасписание(РегЗадание)
	Возврат ПолучитьПараметрРегламентногоЗадания("Расписание", Новый РасписаниеРегламентногоЗадания, РегЗадание);
КонецФункции

&НаСервере
Функция ПолучитьПараметрРегламентногоЗадания(ИмяПараметра, ЗначениеПоУмолчанию, РегЗадание)
	ПараметрыЗадания = Новый Структура;
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		ПараметрыЗадания.Вставить("ИмяМетода", Метаданные.РегламентныеЗадания[РегЗадание].ИмяМетода);
	Иначе
		ПараметрыЗадания.Вставить("Метаданные", Метаданные.РегламентныеЗадания[РегЗадание]);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СписокЗаданий = РегламентныеЗаданияСервер.НайтиЗадания(ПараметрыЗадания);
	Для Каждого Задание Из СписокЗаданий Цикл
		Возврат Задание[ИмяПараметра];
	КонецЦикла;
	
	Возврат ЗначениеПоУмолчанию;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	Запись.ТипОбъекта = "СМЕТА";
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.НастройкиSQL.Видимость = Запись.ХранитьВоВнешнейБазе;
	Элементы.Расписание.Доступность = Запись.СохранятьРегламентно;
	Элементы.НастроитьРасписание.Доступность = Запись.СохранятьРегламентно;
	Элементы.РасписаниеОчистка.Доступность = ЗначениеЗаполнено(Запись.СрокХраненияВерсий);
	Элементы.НастроитьРасписаниеОчистки.Доступность = ЗначениеЗаполнено(Запись.СрокХраненияВерсий);

	Элементы.Расписание.Заголовок = ТекущееРасписание("СМ_СохранятьСостояние");
	Элементы.РасписаниеОчистка.Заголовок = ТекущееРасписание("СМ_ОчисткаИсторииСостояния");
КонецПроцедуры

&НаКлиенте
Процедура ХранитьВоВнешнейБазеПриИзменении(Элемент)
	Элементы.НастройкиSQL.Видимость = Запись.ХранитьВоВнешнейБазе;
КонецПроцедуры

#КонецОбласти
